<template lang="pug">
  v-dialog(v-model="isDescriptionOpened")
    template(v-slot:activator="{ on, attrs }")
      v-btn(v-bind="attrs" v-on="on") 「スクリーン上での読書における1行表示UIの提案と評価」実験の説明
    v-card
      v-card-title.headline.grey.lighten-2(primary-title) 「スクリーン上での読書における1行表示UIの提案と評価」実験の説明
      v-card-text
        .description.mt-8
          h3 1.	研究の意義・目的
          p この研究は、文章の1行だけを表示したUI（以降、1行表示UIと呼びます）を使ってPCの画面上で文章を黙読する方法が、通常の全行を表示してマウスでスクロールすることによって文章を読む方法と比べて、読み速度や読みやすさ、読解力、視線移動の特徴に違いがあるか、を調べることを目的としています。1行表示UIの効果が実証されれば、よりユーザー価値の高い読書アプリケーションを作ることが出来ます。
          h3 2.	研究方法
          p 実験はお一人当たり10～15分程度を予定しています。実験では、実験者（奈良高専学生または教員）の指示に従います。最初に、実験に関する説明を行います。その後、視線移動記録のための準備を行って頂きます（画面上の点をずっと注視するなど）。次に、実験者や画面上の指示に従い、PCで2種類の方法で4つの小説を読んでいただきます。その間の視線移動を記録します。
          h3 3.	実験協力者として選定した理由
          p 視力等に問題がなければ、ご協力いただける皆様に実験協力者をお願いしています。それ以上の理由は一切ありません。
          h3 4.	実験への参加と撤回について
          p 以上の趣旨をご理解いただいた上で、参加をお決め下さい。参加途中でお断り頂くことも可能です（随時お申し出下さい）。途中辞退した場合のデータの取り扱い（分析の可否）は、その方の意思に従います。
          h3 5.	予測されるリスク、心身に対する影響
          p 通常、この実験への参加による心身のリスク・負担はほとんどありません。目の疲れが多少生じる可能性がある程度ですが、実験途中に疲れなど不具合をお感じの場合はすぐにお知らせ下さい。
          h3 6.	研究に参加することによる利益と不利益
          p この研究に参加することにより、実験協力者に直接利益・不利益が無いよう実験を進めますが、万が一不利益を被った場合、奈良工業高等専門学校における人を対象とする研究倫理委員会に対し申し立てをすることができます。
          h3 7.	研究成果の公表の可能性
          p この研究は、論文としてまとめ、学会で発表予定です。論文や発表では、個人が特定されることが決して無いようにデータ表記など行います。
          h3 8.	守秘や個人情報、研究データの取り扱いについて
          p この研究で得られたデータ（個人情報、アンケート回答内容、視線移動記録など全て）は、研究目的以外に用いることはありません。個人情報及び記録データの守秘をお約束致します。
          h3 9.	実験または上記に関する問い合わせ先
          p 奈良工業高等専門学校 電気工学科 小坂までお問い合わせ下さい。
      v-card-actions
        v-spacer
        v-btn(
          color="primary"
          @click="isDescriptionOpened = false"
        ) 閉じる
</template>
<script>
export default {
  data() {
    return {
      isDescriptionOpened: false
    }
  },
  methods: {
    openDescription() {
      this.isDescriptionOpened = !this.isDescriptionOpened
    }
  }
}
</script>
<style lang="scss" scoped>
.description {
  h3 {
    margin-bottom: 8px;
  }
}
</style>
